import React from 'react'
import Image from 'next/image'

export default function history() {
  return (
    <>
      <Image src='/placeholder.png' alt='img' className='' width={400} height={300} />
      <Image src='/placeholder.png' alt='img' className='' width={400} height={300} />
      <h1 className='text-center text-xl font-bold text-gray-700 mt-10'>
        ความเป็นมาที่พวกผมอยากสอนเรื่องออกกำลังกายและสุขภาพให้คนทางออนไลน์
      </h1>
      <div>
        <p className=' text-md  max-w-6xl mx-auto mt-5 '>
          ในยุคที่เทคโนโลยีกลายเป็นส่วนหนึ่งของชีวิตประจำวัน ผู้คนต่างเผชิญกับความเร่งรีบและวิถีชีวิตที่ส่งผลต่อสุขภาพทั้งกายและใจ หลายคนไม่มีเวลาไปฟิตเนส ไม่มีความรู้เรื่องการดูแลตัวเองอย่างถูกต้อง
          หรือขาดแรงจูงใจในการเริ่มต้นดูแลสุขภาพ เราเล็งเห็นปัญหานี้และต้องการสร้างแหล่งข้อมูลออนไลน์ที่เข้าถึงง่าย สนุก และมีคุณภาพ เพื่อให้การดูแลสุขภาพกลายเป็นเรื่องที่ทุกคนทำได้ในชีวิตประจำวัน</p>
      </div>
      <div>
        <h1 className='text-lg font-bold max-w-6xl mx-auto mt-6'>คอนเซป</h1>
        <p className='text-md  max-w-6xl mx-auto mt-2'>&quot;สุขภาพดีในแบบของคุณ ทุกที่ ทุกเวลา&quot; - แพลตฟอร์มที่ผสมผสานการออกกำลังกาย
          และสุขภาพจิตอย่างครบวงจร ผ่านเนื้อหาที่หลากหลาย เช่น วิดีโอสอนออกกำลังกาย ทั้งหมดนี้สามารถเรียนรู้และปฏิบัติได้ง่ายๆ ผ่านออนไลน</p>
        <h1 className='text-lg font-bold max-w-6xl mx-auto mt-6'>สิ่งที่เราให้ความสำคัญ</h1>
        <p className='text-md  max-w-6xl mx-auto mt-2'>
          <li>เข้าถึงง่าย - เนื้อหาที่เหมาะสมสำหรับทุกคน ไม่ว่าจะเป็นมือใหม่หรือผู้มีประสบการณ์</li>
          <li>ความหลากหลาย - ครอบคลุมทุกแง่มุมของสุขภาพ ทั้งกาย ใจ</li>
          <li>ความถูกต้อง - สร้างเนื้อหาที่อ้างอิงจากผู้เชี่ยวชาญด้านสุขภาพและฟิตเนส</li>
          <li>สร้างแรงบันดาลใจ - ช่วยให้ผู้คนตั้งเป้าหมายและมีกำลังใจดูแลตัวเองอย่างต่อเนื่อง</li>
        </p>
      </div>
    </>
  )
}
